netflics/app/views/series/show_all.html.erb

                <div class="summary">
                   Number of seasons: <%= series.season.count %>
---
SELECT COUNT(*) FROM "seasons" WHERE "seasons"."series_id" = $1  [["series_id", 1]]