netflics/app/controllers/series_controller.rb

  def show_all
    @series = Series.all
---
SELECT "series".* FROM "series"

  def create
    series = Series.new(update_params)
    if series.save
      @series = Series.all
---
INSERT INTO "series" ("name", "genre", "country", "language", "summary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "series".* FROM "series"

  def update
    series = Series.find(params[:id])
    series.update_attribute(:name, update_params[:name])
    series.update_attribute(:genre, update_params[:genre])
    series.update_attribute(:country, update_params[:country])
    series.update_attribute(:language, update_params[:language])
    series.update_attribute(:summary, update_params[:summary])
    if series.save
      @series = Series.all
---
SELECT  "series".* FROM "series" WHERE "series"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "series" SET "language" = $1, "updated_at" = $2 WHERE "series"."id" = $3  [["language", 59], ["updated_at", 2017-04-29 22:40:14 UTC], ["id", 2]]
SELECT "series".* FROM "series"

    def set_series
      @series = Series.find(params[:id])
---
SELECT  "series".* FROM "series" WHERE "series"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]