netflics/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "rai"], ["email", "test@test1.cl"], ["updated_at", 2017-04-12 23:39:17 UTC], ["id", 4]]
---
  def update
    @user = User.find(params[:id])
    @user.update_attribute(:first_name, update_params[:first_name])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
  def destroy
    puts (params[:id])
    @user = User.find(params[:id])
    if current_user == @user || admin?
      @user.destroy

SELECT  "roles".* FROM "roles" WHERE "roles"."title" = $1 LIMIT $2  [["title", "Admin"], ["LIMIT", 1]]
---
  def make_admin
    current_user.role=Role.find_by(title: "Admin")